---
kind: other
id: Methods.T:Autodesk.Revit.DB.BuildingPadType
source: html/6d7c7b70-f8c4-8815-4f7a-b576b703d950.htm
---
# BuildingPadType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.